[
	{"title":"LearningEngineer Youtube Channel", "explanation":"Started in 2007, this is LearningEngineer's Youtube Channel.  I started it because I had no place to start the instructional videos I was created for the courses that I was teaching.  I now have almost 5000 subscribers.", "link":"https://www.youtube.com/c/LearningEngineercom"},
	{"title":"Canvas: Writing Studio", "explanation":"This is the latest version of the Writing Studio course I designed for my previous employer using the free version of Canvas.  The only problem is that the SCORM programs do not work in this version of Canvas; however it does serve as a good example.<br>username: canvas@learningengineer.com <br> password: learning", "link":"https://canvas.instructure.com/login/canvas"},
	{"title":"LearningEngineer Moodle Site", "explanation":"This is my Moodle LMS site because it does allow SCORM applications. <br>username: teacherguest <br> password: Learning_1", "link":"https://learningengineer.com/lrnr/"},
	{"title":"LearningEngineer Website", "explanation":"This is my non-profit's website. It contains articles, videos, applications, and publications that I have developed over the years. You are free to use anything you find here so long as it is for non-profit use only.", "link":"https://learningengineer.com"},
	{"title":"Typing Animator", "explanation":"I create a lot of videos that involve typing, and for some reason, my typing gets worse when I am being recorded doing it.  So, I created this typing animator.  It has several options including whether your text is html or text.  You can also choose between two different styles.  I plan to add more.", "link":"https://learningengineer.com/typing/"},{"title":"Spelling Tester", "explanation":"This is a letter jumble spelling tester. The audio tells the student the word, repeats it in a sentence, and then states the word again. The student then places the letter tiles onto the place holders. This has been converted into SCORM packages for uploading into an LMS.", "link":"https://learningengineer.com/practice/spelltest/index.html"},
	{"title":"Find the Subject Level 1", "explanation":"Find the Subject in the Sentence Level 1 requires that the learner find the subject or subjects in a sentence by simply clicking on the word or words in the sentence. This interface is a lot more intuitive, requires fewer interactions, and is less complex. This has also been converted into SCORM packages for uploading into an LMS.", "link":"https://learningengineer.com/practice/findsub1/"},
	{"title":"Find the Subject Level 2", "explanation":"Find the Subject in the Sentence Level 2 requires that the learner find the subject or subjects in a sentence by simply clicking on the word or words in the sentence. This interface is a lot more intuitive, requires fewer interactions, and is less complex. This has also been converted into SCORM packages for uploading into an LMS.", "link":"https://learningengineer.com/practice/findsub2/"},
	{"title":"Find the Verb Level 1", "explanation":"Find the Verb requires that the learner find the verbs or verbs in a sentence by simply clicking on the word or words in the sentece. This interface is a lot more intuitive, requires fewer interactions, and is less complex. This has also been converted into SCORM packages for uploading into an LMS.", "link":"https://learningengineer.com/practice/findverb1/"},
	{"title":"Find the Verb Level 2", "explanation":"Find the Verb requires that the learner find the verbs or verbs in a sentence by simply clicking on the word or words in the sentece. This interface is a lot more intuitive, requires fewer interactions, and is less complex. This has also been converted into SCORM packages for uploading into an LMS.", "link":"https://learningengineer.com/practice/findverb2/"},
	{"title":"Book", "explanation":"I wrote this book back when I was teaching composition and found that most writing books were heavy on grammar and usage but nothing about content. It contains a text to speech engine so that students can have the book read to them. The book focuses more on content, such as providing factual support for claims rather than baseless opinion, than it does on grammar and usage.", "link":"https://mikes4bikes.github.io/book/"},
	{"title":"Ask the Brain", "explanation":"First, this can take some time to load because it has to do the training.  I built this AI application to see if it could be a useful resource for students to test whether or not their sentence is complete or not.", "link":"https://mikes4bikes.github.io/brain/index.html"},
	{"title":"Find the Error: Subject / Verb Agreement", "explanation":"This is a variation of Find the Subject. Here you are finding the Subject / Verb error. Click on the problem in the sentence. The user gets three attempts. After three attempts, the user is told the correct answer and an explanation of the correct answer is provided. This also comes in a SCORM package.", "link":"https://i2cw.github.io/pctc/subverb/index.html"},
	{"title":"Titles: Italics or Quotes.", "explanation":"In this application, the learner must decide if the title that is presented should be italicized or in quotations marks. Can also be packaged into a SCORM.", "link":"https://i2cw.github.io/pctc/titles/index.html"},
	{"title":"Mostly Writing Slides", "explanation":"These are all of the writing slides I have created throughout the years for teaching writing and communication.", "link":"https://mikes4bikes.github.io/slides/"},
	{"title":"Checklist for Revision", "explanation":"I created this SCORM application for an LMS. Using \"adaptive release,\" you can require students to fill out the checklist for revision before they are able to upload their assignment. This comes in a SCORM package as well.", "link":"https://mikes4bikes.github.io/Checklist/"},
	{"title":"HTML Schedule", "explanation":"I created this so that students could just click on the Zoom link right in the schedule rather than trying to Ctrl+click in a Word document.", "link":"https://mikes4bikes.github.io/zms/"},
	{"title":"Course Timeline", "explanation":"I find the user interface of an LMS to be overly complex and not very intuitive, so I was experimenting with this course timeline to see if students found it easier to follow and interact with.", "link":"https://mikes4bikes.github.io/ws/"},
	{"title":"Automated MS Word APA Document", "explanation":"This is a Microsoft Word macro-enabled document that automatically creates and saves an APA Seventh Edition formatted paper.  It opens to a from that asks six questions about the paper being written: title, author, affiliation, due date, instructor's name, and course name.  The form then takes that information and automatically inserts it into the document.  When complete, the document then asks for a file name and then saves the document with that file name to the Documents folder.  The student can simply start typing on the second page.  The link opens up to a page where you can download the file.", "link":"https://learningengineer.com/cloud/docs/APA7thAutoDoc/"},
	{"title":"Simple Computer Repair", "explanation":"This is a book I created back in the late 90s for students who wanted to try and solve their own computer problems rather than pay $50 an hour to a tech who might not be able to solve anything.  I did all the illustrations, photos, text, and layout.", "link":"https://learningengineer.com/cloud/simplecomputerrepair.pdf"},
	{"title":"Doctor Montessori's Own Handbook", "explanation":"When I found out that this gem was in the public domain, I got a copy and then started editing it into this Adobe Acrobat file making sure that all the illustrations and photos lined up with the text that refers to them.  In addition, I updated some of the terminology to help the reader.", "link":"https://learningengineer.com/cloud/DrMontessorsOwnHandbook.pdf"}
	]
