[
	{"sentence":"Your health and safety is our main concerns when it comes to developing policy that affects public health.", "correct_answer":"4", "explanation":"This is an example of subject / verb agreement.There are two subjects: health and safety. Adding two singular subjects together makes them more than one, so they are plural.  Therefore, the verb should be \"are\" and not \"is.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"None of the constestants want to get in a cage with a hungry tiger, and the tiger doesn't seem too happy about it either.", "correct_answer":"0 4", "explanation":"In this sentence the subject is \"none\" and not \"contestants\" because  \"contestants\" is the object of the preposition \"of\" and the object of a preposition cannot be the subect of the sentence.  Since \"none\" is singular the verb should be \"wants\" and not \"want.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"The plethora of laws and regulations surrounding the construction of new buildings mean that there will be a constant shortage of housing, ensuring that there will always be homeless people.", "correct_answer":"1  12", "explanation":"The subject is \"plethora\" which is singular, so the verb should be \"means\" and not \"mean\" in this context because we are referring to a grouping of laws and regulations; however, plethora can also be plural. See the link below for more information", "link":"https://www.merriam-webster.com/words-at-play/plethora-singular-or-plural"},
	{"sentence":"Neither Mary nor her sisters is looking forward to attending Shaka's wedding to be held in January in Longyearbyen: the world's northernmost permanent settlement, located halfway between mainland Norway and the North Pole.", "correct_answer":"5", "explanation":"We have two subjects combined with a negative conjuction \"nor,\" so you should use \"sisters\" as the plural subject, which means that the verb should be \"are\" and not \"is.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"The criteria for entering the contest is simple. First, prove you are who you say you are.  Second, prove how old you are.", "correct_answer":"6", "explanation":"The subject in the first setnence is criteria.  Criteria is plural.  Therefore, the verb in the sentence should is \"are\" and not \"is.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"Here is the five slices of pizza that you ordered from that pizza shop that sits on the corner of Wales and Marbury Streets.", "correct_answer":"1", "explanation":"The subject of the sentence is \"here\" but \"here\" is a pronoun and refers to \"slices\" which is plural. Therefore, the verb should be \"are\" and not \"is.\" ", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"After the Huberson's fire, Ready Insurance made some changes to their policies. Neither the field agents nor their supervisor are happy with the policy changes, but they understand that they were necessary to ensure the solvency of the company.", "correct_answer":"19", "explanation":"In the second sentence, the subjects are \"agents\" and \"supervisor,\" but since they are connected with an \"nor\" we look at the second subject which is \"supervisor,\" which is singular, so the verb should be \"is\" and not \"are.\"",  "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"While Staphylococcus aureus, Salmonella, and Streptococcus are bacteria that can cause severe fever and organ damage but have no vaccines for them, viruses, such as influenza, measles, and polio has vaccines to protect against them.", "correct_answer":"29", "explanation":"The subject of the second clause is \"influenza, measles, and polio,\" which means that the verb should be \"have\" and not \"has.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"My book with its hundreds of pages, thousands of paragraphs, and millions of words look to set a record for sales in its very first week on the market.", "correct_answer":"14", "explanation":"The subject of the sentence is \"book,\" which is singular; therefore, the verb should be \"looks\" instead of \"look.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"Though the terminology and process is (wildly, needlessly) complex, the advice is simple for anyone wanting to borrow $25,000: Take out federal student loans from the government, not private ones that come from a bank or similar institution.", "correct_answer":"5", "explanation":"The subject is a compound subject consisting of \"terminology\" and \"process,\" which means that the subject is plural, making the correct verb, \"are\" and not \"is.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"Firefighters had most of the dozens of fires under control by Friday, allowing thousands of people to return to their homes in the northern port city of Haifa, one of the areas that was hit hardest.", "correct_answer":"33", "explanation":"The subject of the clause is that, a pronoun.  \"That\"'s antecedent is \"areas\" which is plural, so the verb should be \"were\" and not \"was.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"Prosecutors have said that billions of dollars that Goldman raised for a Malaysian government investment fund—known as 1Malaysia Development Berhad, or 1MDB— were channeled into a web of personal bank accounts and was ultimately used to buy paintings, luxury real estate and investment stakes in movies like “The Wolf of Wall Street.”", "correct_answer":"22", "explanation":"The same subject — “billions of dollars” — can’t be used with both the plural verb “were channeled” and the singular “was used.” In this case, it’s probably best to construe “billions of dollars” as an amount rather than a number, and use singular verbs.", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"He later said that an education in critical thinking, reading, writing and math are \"the keys to economic success,\" but he added that \"a holistic education that includes literature and the arts is just as critical to creating good citizens.\"", "correct_answer":"13", "explanation":"The plural verb “are” doesn’t work with the singular subject “education.” (Update: As several sharp-eyed readers noted, a previous version of this explanation, showing a revised version of the sentence, also didn’t work because it didn’t accommodate the plural “keys” within the quote. Best to rephrase the sentence, or paraphrase that part of the quote.)", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"He is undefeated in 17 professional fights. All but one of this victories was by knockout.", "correct_answer":"13", "explanation":"The subject is the plural \"all\" – not the singular \"one\" – so we needed a plural verb, \"were.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"It was clear, though, that Ms. Davis, along with fellow nominees Ruth Negga and Octavia Spencer, were relishing the event.", "correct_answer":"16", "explanation":"Despite the prepositional phrase \"along with...,\" the subject is the singular \"Ms. Davis,\" so the verb should be \"was relishing.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"The arresting officer was black, as was the city’s police chief, its mayor and the majority of the city council that had written the stringent gun and drug laws his client had violated.", "correct_answer":"6", "explanation":"The order of this sentence has been moved around; however, the second \"was\" should be \"were\" because the subjects of that clause are \"chief,\" \"mayor,\" and \"majority,\" making it a compound subject requiring a plural verb.", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"That may be helpful since the length of modern games make traditional doubleheaders a seven-to-eight-hour commitment.  Teams are reluctant to take on such a heavy burden.  Players and coaches feel that it's just too much.", "correct_answer":"10", "explanation":"The subject of the first sentence is \"length\" and not \"games,\" which is the object of the preposition and cannot be the subject of the sentence.", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"Gen. Hulusi Akar, the current chief of staff, remains in his post, but one of the three newly appointed armed forces chiefs are likely to replace him when he retires.  The new chief of staff will most likely find their new position tenuous.", "correct_answer":"22", "explanation":"In the second clause, the subject of the sentence is \"one\" and not \"chiefs\" because \"chiefs\" is the object of the propositional phrase.", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"Watching over it all was her daughter, a medical social worker, and her son-in-law, a financial planner.", "correct_answer":"4", "explanation":"Make it \"Watching over it all were her daughter...and her son-in-law.\" A plural subject, even if it follows the predicate, takes a plural verb.", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"},
	{"sentence":"A vicious cycle of financial mismanagement, combined with other factors like the loss of one-tenth of the islands’ population since 2008, were hampering the Virgin Islands even as the rest of the country bounced back from the Great Recession.", "correct_answer":"21", "explanation":"The subject — \"a vicious cycle\" — is singular and needs a singular verb, \"was hampering.\"", "link":"https://learningengineer.com/slides/subjectverb.html#/menu"}
	
]