[
	{"sentence":"Your health and safety are our main concerns.", "correct_answer":"4", "explanation":"The verb in this sentence is <strong>are</strong>, which is a state-of-being and plural verb because their are two subjects: <strong>health and safety</strong>.", "link":""},
	{"sentence":"None of the constestants wants to get in a cage with a hungry tiger.", "correct_answer":"4", "explanation":"The verb in this sentence is <strong>wants</strong>, which is a singular action verb because the subject of the sentence is <strong>none</strong>.", "link":""},
	{"sentence":"The plethora of laws and regulations surrounding the construction of new buildings mean that there will be a constant shortage of housing, ensuring that there will always be homeless people.", "correct_answer":"12", "explanation":"The verb in this sentence is <strong>mean</strong>, which is a plural verb because the subject of the sentence is <strong>plethora</strong>, and <strong>plethora</strong> is plural.  See the link below for a more detailed explanation.", "link":"https://www.merriam-webster.com/words-at-play/plethora-singular-or-plural"},
	{"sentence":"Here are the five slices of pizza from that pizza shop on the corner of Wales and Marbury Streets.", "correct_answer":"1", "explanation":"The verb in this subject is <strong>are</strong>, which is a plural verb because the subject is <strong>slices</strong>.  When here or there start a sentence, we look past the verb to find the subject of the sentence, which in this case is <strong>slices</strong>.", "link":"https://learningengineer.com/slides/subjectverb.html#/therehere"},
	{"sentence":"Neither the field agents nor their supervisor is happy with the policy changes.", "correct_answer":"7", "explanation":"In this sentence, the verb is <strong>is</strong>, which is singular because the subjects are connected by <strong>nor</strong>.  This means that you use the second subject to determine whether the verb is plural or not.  The second subject is the singular super",  "link":""},
	{"sentence":"My book with its hundreds of pages, thousands of paragraphs, and millions of words looks to set a record for sales in its very first week on the market.", "correct_answer":"14", "explanation":"The verb in this sentence is <strong>looks</strong> because the subject is the singular <strong>book</strong>. ", "link":""},
	{"sentence":"All but one of this victories were by knockout.", "correct_answer":"6", "explanation":"The verb in this sentence is the word <strong>were</strong> because the subject of this sentence is <strong>all</strong>.", "link":""},
	{"sentence":"Watching over it all were her daughter, a medical social worker, and her son-in-law, a financial planner.", "correct_answer":"4", "explanation":"The verb in this sentence is <strong>were</strong> because the subjects of the sentence are <strong>daughter...and her son-in-law<strong>: a plural subject, even if it follows the predicate, is a plural subject.", "link":""},
	{"sentence":"The cruise ship with over 3000 passengers on board was last seen near the Tierra del Fuego.", "correct_answer":"9", "explanation":"The verb in this sentence is <strong>was</strong> which is singular because the subject is <strong>ship</strong> which is also singular.", "link":""},
	{"sentence":"No one from the college's Quiz Bowl team made it to the finals in the tournament of champions.", "correct_answer":"1", "explanation":"The verb in this sentence is <strong>made</strong>, which is singular because the subject is <strong>one</strong>.", "link":""},
	{"sentence":"Everyone of the students sees what is happening at the school board meetings.", "correct_answer":"4", "explanation":"The verb in this sentence is <strong>sees</strong> because the subject is <strong>everyone</strong>, which is an indefinite pronoun and refers to a total number and because of that, <strong>everyone</strong> is considered singular.", "link":""},
	{"sentence":"Both of the teams want to play the game despite the weather.", "correct_answer":"4", "explanation":"The verb in this sentence is <strong>want</strong> and it is considered plural.", "link":""},
	{"sentence":"As of 3:00 pm, neither of the subjects was prepared for their physical.", "correct_answer":"8", "explanation":"The verb in this sentence is <strong>was</strong> because of the singular subject <strong>neither</strong>, and it is singular.", "link":""},
	{"sentence":"On the bus, somebody realized that the lunch bags were missing.", "correct_answer":"4", "explanation":"The verb in this sentence is <strong>realized</strong>, which is in the past tense so we don't have to worry about the subject because subject verb agreement doesn't happen when the verb is past tense.", "link":""},
	{"sentence":"Do you know what's going on tonight at the college?", "correct_answer":"2 3", "explanation":"The first verb in this sentence is <strong>know</strong> verb in this sentence is <strong>what's</strong> because it's a contraction of <strong>what</strong> and <strong>is</strong>.", "link":""},
	{"sentence":"When did your parents decide to move to Los Angeles?", "correct_answer":"1 4", "explanation":"The verb in this sentence is <strong>did and decide</strong>; <strong>Did</strong> is the past tense of <strong>do</strong> and often is paired with <strong>when</strong>.", "link":""},
	{"sentence":"Intensive-care units take artificial control of failing bodies.", "correct_answer":"2", "explanation":"The verb in this sentence is <strong>take</strong>, which is plural because the subject is <strong>units</strong>, which is also plural.", "link":""},
	{"sentence":"The difficulties of life support are considerable.", "correct_answer":"5", "explanation":"The verb in this sentence is <strong>are</strong>, and the subject is <strong>difficulties</strong>.", "link":""},
	{"sentence":"Reviving a drowning victim, for example, is rarely as easy as on television.", "correct_answer":"6", "explanation":"The verb in this sentence is <strong>is</strong> because the subject is <strong>reviving</strong>.", "link":""},
	{"sentence":"Following instructions from an emergency physician on the phone, they began cardiopulmonary resuscitation.", "correct_answer":"10", "explanation":"The verb in this sentence is <strong>began</strong>, and since it is past tense we don't need to care about singular or plural.", "link":""}
	
]