[
	{"sentence":"Then you must add the difficulties of orchestrating them in the right sequence, with nothing dropped, leaving some room for improvisation, but not too much.", "correct_answer":"3", "explanation":"The only verb in this sentence is <strong>add</strong>, which is plural because <strong>you</strong>, the subject, is plural.", "link":"https://blogs.illinois.edu/view/25/686417"},
	{"sentence":"For every drowned and pulseless child rescued by intensive care, there are many more.", "correct_answer":"6 11", "explanation":"Both <strong>rescued</strong> and <strong>are</strong> are the verbs in this sentence. However, <strong>rescued</strong> is the verb in the dependent clause while <strong>are</strong> is part of an independent clause.", "link":"https://editorsmanual.com/articles/it-there-dummy-subjects-grammar/"},
	{"sentence":"On any given day in the United States, some ninety thousand people are in intensive care.", "correct_answer":"12", "explanation":"The verb is <strong>are</strong>, which is plural because the subject is the plural <strong>people</strong>.", "link":""},
	{"sentence":"For ten days, though, all went well.", "correct_answer":"5", "explanation":"The verb in this sentence is <strong>went</strong>, which is past-tense, so we don't have to know what the subject is.", "link":"https://www.merriam-webster.com/dictionary/all"},
	{"sentence":"The names of the manager, who CEO Kirland said was an eight-year veteran of the New Yorker Investigative Reporting Department, and the woman were not released.", "correct_answer":"8 9 23 25", "explanation":"The verbs in this sentence are <strong>said, was, were, and released</strong>. In the first part, the pronoun <strong>who</strong> is with the verb <strong>was</strong> and <strong>CEO Kirkland</strong> is with <strong>said</strong>.  In the second part, <strong>were not released</strong> is a passive voice phrase used when we know the objects, the manager and the woman, but not the person not doing the releasing", "link":"https://www.youtube.com/watch?v=nkAyggAM1q4"},
	{"sentence":"To be the best students—Artimus, Grynidia, Rolando, Tracy, and Sasha decided to skip the movie and go to Rolando's house to study.", "correct_answer":"10 16", "explanation":"The verbs in this sentence are <strong>decided</strong> and <strong>go</strong>. <strong>Decided</strong> is past tense, so no worries there, but <strong>go</strong> is not. There are multiple subjects, so you need a plural verb and <strong>go</strong> is a plural verb.", "link":""},
	{"sentence":"There is only one way to solve a problem.", "correct_answer":"1", "explanation":"The only verb in this sentence is <strong>is</strong> because the pronoun <strong>there</strong> refers to <strong>one</strong>, which is singular, so we need to use a singular verb: <strong>is</strong>", "link":"https://www.english-grammar-revolution.com/there-is.html"},
	{"sentence":"When young, dogs are called puppies.", "correct_answer":"3", "explanation":"Since the subject is <strong>dogs</strong>, which is plural, we need a plural verb: <strong>are</strong>.", "link":""},
	{"sentence":"Ham on rye is my favorite type of sandwhich.", "correct_answer":"3", "explanation":"In this sentence, the verb is <strong>is</strong> because the subject is <strong>ham</strong>, which is singular.", "link":""},
	{"sentence":"As far as magazines, The Economist is my favorite.", "correct_answer":"6", "explanation":"The verb is <strong>is</strong> because the subject is <strong>Economist</strong>, which is the name of a single entity: singular.", "link":""},
	{"sentence":"In the continuing quest for greatness, please remember that you can learn a lot from people whose startups died.", "correct_answer":"7 10 18", "explanation":"The verbs in this sentence are <strong>remember</strong>, <strong>can</strong>, and <strong>died</strong>. <strong>Remember</strong>'s subject is an implied you unlike <strong>can</strong>, which has <strong>you</strong> as its subject.  <strong>Died</strong>'s subject doesn't matter because it's past-tense.", "link":""},
	{"sentence":"High quality learning environments are a necessary precondition for the facilitation and enhancement of the ongoing learning process.", "correct_answer":"4", "explanation":"Here the verb is <strong>are</strong> because the subject is <strong>environments</strong>.", "link":""},
	{"sentence":"Given all these facts, how do you still not understand what is going on in the banking sector.", "correct_answer":"6", "explanation":"There are several verbs in this sentence starting with <strong>understand</strong>, which is plural because its subject is <strong>you</strong>.  The next verb is, well, <strong>is</strong> because its subject is the pronoun <strong>what</strong>, which is singular.", "link":""},
	{"sentence":"At base level, this just comes down to three-dimensional strategic contingencies.", "correct_answer":"5", "explanation":"The verb in this sentence is <strong>comes</strong>, which is singular because the subject is the singular pronoun <strong>this</strong>.", "link":""},
	{"sentence":"Natalia, Bristol, Boris, and I can make a window to discuss your interactive logistical contingencies.", "correct_answer":"6", "explanation":"There are four subjects for this sentence: Natalia, Bristol, Boris, and I; therefore, the verb has to be the plural <strong>make</strong>.", "link":" "},
	{"sentence":"Both of the corporate leaders in the regulatory lobbying sector are going forward with their plans to implement holistic modular matrix approaches.", "correct_answer":"0", "explanation":"Since the subject is <strong>both</strong>, which is plural, the verb is the plural <strong>are</strong>.", "link":""},
	{"sentence":"Our exploratory but inconclusive research points to remote transitional consulting.", "correct_answer":"5", "explanation":"The verb in this sentence is singular <strong>points</strong> because the subject is the singular <strong>research</strong>.", "link":""},
	{"sentence":"My organisation's department of human resources believes in holistic logistical concepts.", "correct_answer":"6", "explanation":"Here the verb is the singular <strong>believes</strong> because the subject is the singular <strong>department</strong>.", "link":""},
	{"sentence":"Several more firms need to get on-message about our ambient strategic resources.", "correct_answer":"3", "explanation":"The verb is <strong>need</strong> beccause the subject is the plural <strong>firms</strong>.", "link":""},
	{"sentence":"Remarkably, the nurses and doctors were observed to make an error in just one per cent of these actions—but that still amounted to an average of two errors a day with every patient.", "correct_answer":"5 6 21", "explanation":"In the first sentence, the two verbs in a passive verb phrase are <strong>were observed</strong>; however, in the second sentence, the verb is <strong>amounted</strong>, which is past-tense so we don't need to worry about singular or plural.", "link":"https://www.thoughtco.com/uses-of-that-1210017"}
	]