[
	{"sentence":"Then you must add the difficulties of orchestrating them in the right sequence, with nothing dropped, leaving some room for improvisation, but not too much.", "correct_answer":"1", "explanation":"The only subject in this sentence is \"you.\" And, you is always a plural subject.", "link":"https://blogs.illinois.edu/view/25/686417"},
	{"sentence":"For every drowned and pulseless child rescued by intensive care, there are many more.", "correct_answer":"12", "explanation":"While the subject may be \"there,\" the subject in number is \"many,\" which is plural.", "link":"https://editorsmanual.com/articles/it-there-dummy-subjects-grammar/"},
	{"sentence":"On any given day in the United States, some ninety thousand people are in intensive care.", "correct_answer":"8", "explanation":"The subject is \"some,\" but \"some\" can be either singular or plural, so then we look at what comes next and some is referring to \"ninety thousand people,\" which is plural.", "link":"https://www.merriam-webster.com/dictionary/some"},
	{"sentence":"For ten days, though, all went well.", "correct_answer":"4", "explanation":"The subject here is \"all\" and it is plural in this context because it is referring to multiple procedures that were performed.", "link":"https://www.merriam-webster.com/dictionary/all"},
	{"sentence":"The names of the manager, who CEO Kirland said was an eight-year veteran of the New Yorker Investigative Reporting Department, and the woman were not released.", "correct_answer":"1", "explanation":"The subject of the main sentence is \"names,\" which is, of course, plural.", "link":"https://learningengineer.com/slides/subjectverb.html#/prepositions"},
	{"sentence":"To be the best students — Artimus, Grynidia, Rolando, Tracy, and Sasha decided to skip the movie and go to Rolando's house to study.", "correct_answer":"6 7 8 9 11", "explanation":"The subjects of the sentence are the proper names after the dash: Artimus, Grynidia, Rolando, Tracy, Sasha.", "link":""},
	{"sentence":"There is only one way to solve a problem.", "correct_answer":"4", "explanation":"While \"there\" is the subject, \"there\" is a pronound, so we need to look at the antecedent to determine whether it is plural or not. The subject and antecedent is \"way.\"", "link":"https://www.english-grammar-revolution.com/there-is.html"},
	{"sentence":"When young, dogs are called puppies.", "correct_answer":"2", "explanation":"The subject is \"dogs.\"", "link":""},
	{"sentence":"Ham on rye is my favorite type of sandwhich.", "correct_answer":"0", "explanation":"In this sentence, the subject is \"ham.\"", "link":""},
	{"sentence":"As far as magazines, The Economist is my favorite.", "correct_answer":"5", "explanation":"The subject is \"Economist,\" which is the proper name of the magazine.", "link":""},
	{"sentence":"In the continuing quest for greatness, please remember that you can learn a lot from people whose startups died.", "correct_answer":"9", "explanation":"The subject of this sentence is \"you,\" which is implied before \"please remember.\"", "link":""},
	{"sentence":"High quality learning environments are a necessary precondition for facilitation and enhancement of the ongoing learning process.", "correct_answer":"3", "explanation":"Here the subject is \"environments.\"  The words before it are adjectives.", "link":""},
	{"sentence":"Given all these facts, how do you still not understand what is going on in the banking sector.", "correct_answer":"6", "explanation":"This sentence is a question, so the subject is \"you.\"", "link":""},
	{"sentence":"At base level, this just comes down to three-dimensional strategic contingencies.", "correct_answer":"3", "explanation":"The subject of this sentence is the pronoun \"this.\" And, this is singular.", "link":""},
	{"sentence":"Natalia, Bristol, Boris, and I can make a window to discuss your interactive logistical contingencies.", "correct_answer":"0 1 2 4", "explanation":"There are four subjects for this sentence: Natalia, Bristol, Boris, and I.", "link":" "},
	{"sentence":"Both of the corporate leaders in the regulatory lobbying sector are going forward with their plans to implement holistic modular matrix approaches.", "correct_answer":"0", "explanation":"The subject is \"both,\" which is singular.", "link":""},
	{"sentence":"Our exploratory but inconclusive research points to remote transitional consulting.", "correct_answer":"4", "explanation":"\"Research\" is the subject of this sentence.", "link":""},
	{"sentence":"My organisation's department of human resources believes in holistic logistical concepts.", "correct_answer":"2", "explanation":"The subject is \"department,\" which is a noun, and we know that because it ends with -ment.  -Ment is how we turn verbs like \"depart\" and turn them into nouns. The more you know.", "link":""},
	{"sentence":"Several more firms need to get on-message about our ambient strategic resources.", "correct_answer":"2", "explanation":"The subject is \"several\" and not firms, but it wouldn't matter because both are plural.", "link":""},
	{"sentence":"Remarkably, the nurses and doctors were observed to make an error in just one per cent of these actions—but that still amounted to an average of two errors a day with every patient.", "correct_answer":"2 4 19", "explanation":"In the first sentence, the two subjects are \"nurses\" and \"doctors:\" however, in the second sentence, the subject is the pronoun \"that.\"", "link":"https://www.thoughtco.com/uses-of-that-1210017"}
	]